1.
cnt=c( 1, 3, 2, 1, 5, 5, 4, 3, 1, 4)
money=c(2, 8, 7, 4, 13, 12, 9, 9, 3, 10)
plot(cnt, money, pch=16) # 산점도
cor(cnt,money) # 0.97
# 강한 양의 상관 관계

2.(파이썬)
# 2.26x+1.15
3.(파이썬)
# 0.23x+-377.24

4.
page=c(4, 14, 25, 32, 43, 57, 72, 85, 90)
price=c(16, 19, 15, 17, 19, 15, 16, 15, 17)
plot(page, price, pch=16) # 산점도
cor(page,price) # -0.28
# 약한 음의 상관 관계
# -0.014x+17.218
# sse=18.69 ssr=1.53 sst=20.22
# 0.075
# 0.57
# 5.59보다 작아서 귀무가설을 기각할 수 없다ㅠ

5
# 54.755x-745.252
# 19.995, 6.6보다 커서 귀무가설을 기각할 수 있다!
# 1992.5

6.
# 7.09x+65.1
# 72.2, 143.1
# 504.68, 타당하지 않다

7.
# -0.192x+35.58
# 0.58, 0.334

8.
weight=c(2715,2570 ,2610 ,2750 ,3000 ,3410 ,3640 ,3700 ,3880 ,3900 ,4060 ,4710)
money=c(24,28,29,38,25,22,20,26,21,18,18,15)
plot(weight, money, pch=16) # 산점도
cor(weight,money) # -0.8
# 강한 음의 상관 관계

9.
# -0.00725x+48.408
# 0.64
# 17.76, 4.96보다 크므로 귀무가설을 기각할 수 있다!